In [1]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

### For these exercises you have to use the students table that was created in the notebook 02 and the alumni table created in the notebook 04 plus a new table called mentorship

In [2]:
%%sql
DROP TABLE IF EXISTS mentorship;

 * postgresql://user:***@localhost:5432/postgres
Done.

[]

In [3]:

%%sql
CREATE TABLE mentorship (
    mentor_name TEXT NOT NULL,
    mentee_name TEXT NOT NULL,
    mentee_major TEXT,
    PRIMARY KEY (mentor_name, mentee_name)
);


INSERT INTO mentorship (mentor_name, mentee_name, mentee_major) VALUES
('Alice', 'Bob', 'Economics'),
('Bob', 'Charlie', 'Chemistry'),
('Hannah', 'Diana', 'Computer Science'),
('Grace', 'Mark', 'History'),
('Alice', 'Grace', 'Arts'),
('Frank', 'Ian', 'Biology'),
('Eve', 'Frank', 'Social Work');

 * postgresql://user:***@localhost:5432/postgres
Done.
7 rows affected.

[]

In [4]:
%%sql 
SELECT * FROM students;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(1, 'Alice', 20, 'Computer Science'),
 (2, 'Bob', 22, 'Economics'),
 (3, 'Charlie', 19, 'Chemistry'),
 (4, 'Diana', 21, 'Computer Science'),
 (5, 'Eve', 18, None),
 (6, 'Mark', 25, 'History')]

In [5]:
%%sql
SELECT * FROM alumni;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(7, 'Grace', 2019, 'Arts'),
 (8, 'Hannah', 2021, 'History'),
 (9, 'Ian', 2020, 'Biology'),
 (10, 'Diana', 2023, 'Biology'),
 (11, 'Alice', 2022, 'Civil Engineering'),
 (12, 'Frank', 2020, 'Social Work')]

In [ ]:
%%sql
SELECT * FROM mentorship;

 * postgresql://user:***@localhost:5432/postgres
7 rows affected.

[('Alice', 'Bob', 'Economics'),
 ('Bob', 'Charlie', 'Chemistry'),
 ('Hannah', 'Diana', 'Computer Science'),
 ('Grace', 'Mark', 'History'),
 ('Alice', 'Grace', 'Arts'),
 ('Frank', 'Ian', 'Biology'),
 ('Eve', 'Frank', 'Social Work')]

### 1. Create a CTE cs_students that selects all students majoring in Computer Science. Then select all columns from this CTE.

### 2. Create a CTE recent_alumni selecting alumni who graduated in or after 2022. Then show their names and graduation year.

### 3. Create a CTE major_count that counts how many students are in each major. Then select only majors with more than 1 student.

### 4. Create two CTEs: cs_students (students in History or Economics) and cs_alumni (alumni in Biology or Arts). Then show all possible pairs of student and alumni names.

### 5. Create a CTE students_age selecting student names and ages. Then select from the CTE and order by age descending.

### 6. Create a CTE student_info that selects students and adds a column age_next_year = age + 1. Then select all columns from the CTE.

### 7. Create two CTEs: one for all students, one for all alumni, each with name and type columns. Then combine them to get a full list of names with type.

### 8. For each major find the total number of people related to it. Use alumni and students tables

### 9. Create a CTE student_alumni_pairs that joins students and alumni on major (full outer join). Then select names and use COALESCE to show a single name column.

### 10. Assume we have a mentorship table (mentor_name, mentee_name). Create a recursive CTE to find all mentees of a given mentor including indirect mentees.

Hint: use recursive CTE